In [14]:
import mysql.connector as connection
import pandas as pd
try:
    mydb = connection.connect(host="localhost", database = 'school', user="root", passwd="root", use_pure=True)
    query = "Select * from students"
    students_df = pd.read_sql(query, mydb)
    #mydb.close() #close the connection
except Exception as e:
    # mydb.close()
    print(str(e))

C:\Users\Asabeneh\AppData\Local\Temp\ipykernel_14544\1086422989.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  students_df = pd.read_sql(query, mydb)

In [16]:
query = "Select * from students"
courses_df = pd.read_sql(query, mydb)

C:\Users\Asabeneh\AppData\Local\Temp\ipykernel_14544\1325545752.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  courses_df = pd.read_sql(query, mydb)

In [17]:
courses_df

,StudentID,StudentName,Age,Email,EnrollmentDate,Major
0,1,Alice,20,alice@school.com,2023-09-01,Computer Science
1,2,Bob,21,bob@school.com,2023-09-01,Biology
2,3,Charlie,19,charlie@school.com,2024-01-15,History
3,4,Diana,22,diana@school.com,2022-09-01,Art

In [ ]:
query = "Select * from students"
courses_df = pd.read_sql(query, mydb)